**1st and 2nd session of EDA**

In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

In [3]:
# creating a dataframe
name=['Tarun','Soumya','Pratipada','Jaggu','Malaya']
age=[23,24,23,23,25]
row=['A','B','C','D','E']
col=['Name','Age']
df=pd.DataFrame(zip(name,age),index=row,columns=col)
df

        Name  Age
A      Tarun   23
B     Soumya   24
C  Pratipada   23
D      Jaggu   23
E     Malaya   25

In [5]:
# add a column
city=['JSP','JJP','KP','BLS','JJP']
df['City']=city
df

        Name  Age City
A      Tarun   23  JSP
B     Soumya   24  JJP
C  Pratipada   23   KP
D      Jaggu   23  BLS
E     Malaya   25  JJP

In [7]:
# empty dataframe
df1=pd.DataFrame()
df1

Empty DataFrame
Columns: []
Index: []

In [9]:
name=['Tarun','Soumya','Pratipada','Jaggu','Malaya']
age=[23,24,23,23,25]
city=['JSP','JJP','KP','BLS','JJP']
df1['Name']=name
df1['Age']=age
df1['City']=city
df1

        Name  Age City
0      Tarun   23  JSP
1     Soumya   24  JJP
2  Pratipada   23   KP
3      Jaggu   23  BLS
4     Malaya   25  JJP

In [11]:
dict={'Name':['Tarun','Soumya','Pratipada','Jaggu','Malaya'],'Age':[23,24,23,23,25],'City':['JSP','JJP','KP','BLS','JJP']}
pd.DataFrame(dict)

        Name  Age City
0      Tarun   23  JSP
1     Soumya   24  JJP
2  Pratipada   23   KP
3      Jaggu   23  BLS
4     Malaya   25  JJP

In [13]:
dict={'Name':'Tarun','Age':23,'City':'JSP'}
pd.DataFrame(dict,index=[1])

    Name  Age City
1  Tarun   23  JSP

In [40]:
l=[1,2,3,4]
np.array(l)

array([1, 2, 3, 4])

In [44]:
l=[1,2,3,4]
np.array(l)

array([1, 2, 3, 4])

In [54]:
l1=[5,6,7,8]
l+l1

[1, 2, 3, 4, 5, 6, 7, 8]

In [56]:
np.array(l)+np.array(l1)

array([ 6,  8, 10, 12])

In [58]:
np.array(l)*np.array(l1)

array([ 5, 12, 21, 32])

In [23]:
name=['T','S','M']
age=[21,22,23]
col=['Name','Age']
df2=pd.DataFrame(zip(name,age),columns=col)
df2

  Name  Age
0    T   21
1    S   22
2    M   23

In [25]:
df2.drop('Name',axis=1,inplace=True)

In [27]:
name=['Tarun','Soumya','Pratipada','Jaggu','Malaya']
age=[23,24,23,23,25]
city=['JSP','JJP','KP','BLS','JJP']
df1['Name']=name
df1['Age']=age
df1['City']=city
df1

        Name  Age City
0      Tarun   23  JSP
1     Soumya   24  JJP
2  Pratipada   23   KP
3      Jaggu   23  BLS
4     Malaya   25  JJP

In [33]:
df1.drop('City',axis=1,inplace=True)
df1

        Name  Age
0      Tarun   23
1     Soumya   24
2  Pratipada   23
3      Jaggu   23
4     Malaya   25

In [31]:
df1.drop(2,axis=0)

     Name  Age City
0   Tarun   23  JSP
1  Soumya   24  JJP
3   Jaggu   23  BLS
4  Malaya   25  JJP

In [35]:
name=['T','S']
age=[22,23]
col=['Name','Age']
df3=pd.DataFrame(zip(name,age),columns=col)
df3

  Name  Age
0    T   22
1    S   23

In [39]:
name1=['M','P']
age1=[25,26]
col=['Name','Age']
df4=pd.DataFrame(zip(name1,age1),columns=col)
df4

  Name  Age
0    M   25
1    P   26

In [51]:
pd.concat([df3,df4])

  Name  Age
0    T   22
1    S   23
0    M   25
1    P   26

In [ ]:
name=['Tarun','Soumya','Pratipada','Jaggu','Malaya']
age=[23,24,23,23,25]
city=['JSP','JJP','KP','BLS','JJP']
df1['Name']=name
df1['Age']=age
df1['City']=city
df1

In [3]:
visa_df=pd.read_csv(r"C:\Users\suman\Desktop\Desktop\DATASCIENCE & AI\DATA FILES\Visadataset (1).csv")
visa_df

,case_id,continent,education_of_employee,has_job_experience,requires_job_training,no_of_employees,yr_of_estab,region_of_employment,prevailing_wage,unit_of_wage,full_time_position,case_status
0,EZYV01,Asia,High School,N,N,14513,2007,West,592.2029,Hour,Y,Denied
1,EZYV02,Asia,Master's,Y,N,2412,2002,Northeast,83425.6500,Year,Y,Certified
2,EZYV03,Asia,Bachelor's,N,Y,44444,2008,West,122996.8600,Year,Y,Denied
3,EZYV04,Asia,Bachelor's,N,N,98,1897,West,83434.0300,Year,Y,Denied
4,EZYV05,Africa,Master's,Y,N,1082,2005,South,149907.3900,Year,Y,Certified
...,...,...,...,...,...,...,...,...,...,...,...,...
25475,EZYV25476,Asia,Bachelor's,Y,Y,2601,2008,South,77092.5700,Year,Y,Certified
25476,EZYV25477,Asia,High School,Y,N,3274,2006,Northeast,279174.7900,Year,Y,Certified
25477,EZYV25478,Asia,Master's,Y,N,1121,1910,South,146298.8500,Year,N,Certified
25478,EZYV25479,Asia,Master's,Y,Y,1918,1887,West,86154.7700,Year,Y,Certified
25479,EZYV25480,Asia,Bachelor's,Y,N,3195,1960,Midwest,70876.9100,Year,Y,Certified

In [5]:
visa_df.head()

,case_id,continent,education_of_employee,has_job_experience,requires_job_training,no_of_employees,yr_of_estab,region_of_employment,prevailing_wage,unit_of_wage,full_time_position,case_status
0,EZYV01,Asia,High School,N,N,14513,2007,West,592.2029,Hour,Y,Denied
1,EZYV02,Asia,Master's,Y,N,2412,2002,Northeast,83425.6500,Year,Y,Certified
2,EZYV03,Asia,Bachelor's,N,Y,44444,2008,West,122996.8600,Year,Y,Denied
3,EZYV04,Asia,Bachelor's,N,N,98,1897,West,83434.0300,Year,Y,Denied
4,EZYV05,Africa,Master's,Y,N,1082,2005,South,149907.3900,Year,Y,Certified

In [7]:
visa_df.tail()

,case_id,continent,education_of_employee,has_job_experience,requires_job_training,no_of_employees,yr_of_estab,region_of_employment,prevailing_wage,unit_of_wage,full_time_position,case_status
25475,EZYV25476,Asia,Bachelor's,Y,Y,2601,2008,South,77092.57,Year,Y,Certified
25476,EZYV25477,Asia,High School,Y,N,3274,2006,Northeast,279174.79,Year,Y,Certified
25477,EZYV25478,Asia,Master's,Y,N,1121,1910,South,146298.85,Year,N,Certified
25478,EZYV25479,Asia,Master's,Y,Y,1918,1887,West,86154.77,Year,Y,Certified
25479,EZYV25480,Asia,Bachelor's,Y,N,3195,1960,Midwest,70876.91,Year,Y,Certified

In [9]:
visa_df.shape

(25480, 12)

In [11]:
visa_df.shape[0]

25480

In [13]:
visa_df.shape[1]

12

In [15]:
visa_df.size

305760

In [17]:
visa_df.shape[0]*visa_df.shape[1]

305760

In [19]:
visa_df.columns

Index(['case_id', 'continent', 'education_of_employee', 'has_job_experience',
       'requires_job_training', 'no_of_employees', 'yr_of_estab',
       'region_of_employment', 'prevailing_wage', 'unit_of_wage',
       'full_time_position', 'case_status'],
      dtype='object')

In [21]:
list(visa_df.columns)

['case_id',
 'continent',
 'education_of_employee',
 'has_job_experience',
 'requires_job_training',
 'no_of_employees',
 'yr_of_estab',
 'region_of_employment',
 'prevailing_wage',
 'unit_of_wage',
 'full_time_position',
 'case_status']

In [23]:
visa_df.dtypes

case_id                   object
continent                 object
education_of_employee     object
has_job_experience        object
requires_job_training     object
no_of_employees            int64
yr_of_estab                int64
region_of_employment      object
prevailing_wage          float64
unit_of_wage              object
full_time_position        object
case_status               object
dtype: object

In [27]:
type(visa_df.dtypes)

pandas.core.series.Series

In [25]:
visa_df.dtypes.keys()

Index(['case_id', 'continent', 'education_of_employee', 'has_job_experience',
       'requires_job_training', 'no_of_employees', 'yr_of_estab',
       'region_of_employment', 'prevailing_wage', 'unit_of_wage',
       'full_time_position', 'case_status'],
      dtype='object')

In [29]:
visa_df.dtypes.values

array([dtype('O'), dtype('O'), dtype('O'), dtype('O'), dtype('O'),
       dtype('int64'), dtype('int64'), dtype('O'), dtype('float64'),
       dtype('O'), dtype('O'), dtype('O')], dtype=object)

In [31]:
d=visa_df.dtypes
cat=[]
num=[]
for i,j in d.items():
    if j=='object':
        cat.append(i)
    else:
        num.append(i)

cat,num

(['case_id',
  'continent',
  'education_of_employee',
  'has_job_experience',
  'requires_job_training',
  'region_of_employment',
  'unit_of_wage',
  'full_time_position',
  'case_status'],
 ['no_of_employees', 'yr_of_estab', 'prevailing_wage'])

In [33]:
cat=[i for i, j in d.items() if j=='object']
num=[i for i,j in d.items() if j!='object']
cat, num

(['case_id',
  'continent',
  'education_of_employee',
  'has_job_experience',
  'requires_job_training',
  'region_of_employment',
  'unit_of_wage',
  'full_time_position',
  'case_status'],
 ['no_of_employees', 'yr_of_estab', 'prevailing_wage'])

In [35]:
cat=[i for i, j in d.items() if j=='object']
num=[i for i,j in d.items() if j!='object']
cat, num

(['case_id',
  'continent',
  'education_of_employee',
  'has_job_experience',
  'requires_job_training',
  'region_of_employment',
  'unit_of_wage',
  'full_time_position',
  'case_status'],
 ['no_of_employees', 'yr_of_estab', 'prevailing_wage'])

In [37]:
visa_df.select_dtypes(include='object').columns

Index(['case_id', 'continent', 'education_of_employee', 'has_job_experience',
       'requires_job_training', 'region_of_employment', 'unit_of_wage',
       'full_time_position', 'case_status'],
      dtype='object')

In [39]:
visa_df.select_dtypes(exclude='object').columns

Index(['no_of_employees', 'yr_of_estab', 'prevailing_wage'], dtype='object')

In [41]:
visa_df.dtypes.isnull()

case_id                  False
continent                False
education_of_employee    False
has_job_experience       False
requires_job_training    False
no_of_employees          False
yr_of_estab              False
region_of_employment     False
prevailing_wage          False
unit_of_wage             False
full_time_position       False
case_status              False
dtype: bool

In [43]:
visa_df.isnull().sum()

case_id                  0
continent                0
education_of_employee    0
has_job_experience       0
requires_job_training    0
no_of_employees          0
yr_of_estab              0
region_of_employment     0
prevailing_wage          0
unit_of_wage             0
full_time_position       0
case_status              0
dtype: int64

In [45]:
visa_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 25480 entries, 0 to 25479
Data columns (total 12 columns):
 #   Column                 Non-Null Count  Dtype
---  ------                 --------------  -----
 0   case_id                25480 non-null  object
 1   continent              25480 non-null  object
 2   education_of_employee  25480 non-null  object
 3   has_job_experience     25480 non-null  object
 4   requires_job_training  25480 non-null  object
 5   no_of_employees        25480 non-null  int64
 6   yr_of_estab            25480 non-null  int64
 7   region_of_employment   25480 non-null  object
 8   prevailing_wage        25480 non-null  float64
 9   unit_of_wage           25480 non-null  object
 10  full_time_position     25480 non-null  object
 11  case_status            25480 non-null  object
dtypes: float64(1), int64(2), object(9)
memory usage: 2.3+ MB

In [47]:
l=[1,2,3]
visa_df.take(l,axis=1)

      continent education_of_employee has_job_experience
0          Asia           High School                  N
1          Asia              Master's                  Y
2          Asia            Bachelor's                  N
3          Asia            Bachelor's                  N
4        Africa              Master's                  Y
...         ...                   ...                ...
25475      Asia            Bachelor's                  Y
25476      Asia           High School                  Y
25477      Asia              Master's                  Y
25478      Asia              Master's                  Y
25479      Asia            Bachelor's                  Y

[25480 rows x 3 columns]

In [49]:
l=[1,2,3]
visa_df.take([300,400,4000],axis=0)

,case_id,continent,education_of_employee,has_job_experience,requires_job_training,no_of_employees,yr_of_estab,region_of_employment,prevailing_wage,unit_of_wage,full_time_position,case_status
300,EZYV301,Asia,Master's,Y,N,3268,2012,Midwest,101371.21,Year,Y,Certified
400,EZYV401,Europe,Bachelor's,Y,N,714,1873,West,113927.99,Week,Y,Certified
4000,EZYV4001,Asia,Doctorate,Y,N,1043,1978,Northeast,17729.48,Year,Y,Certified

In [51]:
visa_df.iloc[1:5,5:10]

,no_of_employees,yr_of_estab,region_of_employment,prevailing_wage,unit_of_wage
1,2412,2002,Northeast,83425.65,Year
2,44444,2008,West,122996.86,Year
3,98,1897,West,83434.03,Year
4,1082,2005,South,149907.39,Year

In [53]:
visa_df.iloc[:,:]

,case_id,continent,education_of_employee,has_job_experience,requires_job_training,no_of_employees,yr_of_estab,region_of_employment,prevailing_wage,unit_of_wage,full_time_position,case_status
0,EZYV01,Asia,High School,N,N,14513,2007,West,592.2029,Hour,Y,Denied
1,EZYV02,Asia,Master's,Y,N,2412,2002,Northeast,83425.6500,Year,Y,Certified
2,EZYV03,Asia,Bachelor's,N,Y,44444,2008,West,122996.8600,Year,Y,Denied
3,EZYV04,Asia,Bachelor's,N,N,98,1897,West,83434.0300,Year,Y,Denied
4,EZYV05,Africa,Master's,Y,N,1082,2005,South,149907.3900,Year,Y,Certified
...,...,...,...,...,...,...,...,...,...,...,...,...
25475,EZYV25476,Asia,Bachelor's,Y,Y,2601,2008,South,77092.5700,Year,Y,Certified
25476,EZYV25477,Asia,High School,Y,N,3274,2006,Northeast,279174.7900,Year,Y,Certified
25477,EZYV25478,Asia,Master's,Y,N,1121,1910,South,146298.8500,Year,N,Certified
25478,EZYV25479,Asia,Master's,Y,Y,1918,1887,West,86154.7700,Year,Y,Certified
25479,EZYV25480,Asia,Bachelor's,Y,N,3195,1960,Midwest,70876.9100,Year,Y,Certified

In [55]:
visa_df.iloc[1:10:2,[1,2,3,4,5]]

,continent,education_of_employee,has_job_experience,requires_job_training,no_of_employees
1,Asia,Master's,Y,N,2412
3,Asia,Bachelor's,N,N,98
5,Asia,Master's,Y,N,2339
7,North America,Bachelor's,Y,N,3035
9,Europe,Doctorate,Y,N,2251

In [57]:
visa_df.iloc[[100,200,300],[5]] #dataframe

     no_of_employees
100             2227
200             3282
300             3268

In [59]:
visa_df.iloc[[100,200,300],5]  #series

100    2227
200    3282
300    3268
Name: no_of_employees, dtype: int64

In [61]:
list(visa_df.columns).index('no_of_employees')

5

In [63]:
visa_df.iloc[[100,200,300],[list(visa_df.columns).index('no_of_employees')]]

     no_of_employees
100             2227
200             3282
300             3268

In [65]:
visa_df.loc[[100,200,300],['no_of_employees']]

     no_of_employees
100             2227
200             3282
300             3268

In [69]:
visa_df['case_status']

0           Denied
1        Certified
2           Denied
3           Denied
4        Certified
           ...
25475    Certified
25476    Certified
25477    Certified
25478    Certified
25479    Certified
Name: case_status, Length: 25480, dtype: object

In [91]:
visa_df.loc[:,['case_status']]

      case_status
0          Denied
1       Certified
2          Denied
3          Denied
4       Certified
...           ...
25475   Certified
25476   Certified
25477   Certified
25478   Certified
25479   Certified

[25480 rows x 1 columns]

In [93]:
visa_df.iloc[:,[11]]

      case_status
0          Denied
1       Certified
2          Denied
3          Denied
4       Certified
...           ...
25475   Certified
25476   Certified
25477   Certified
25478   Certified
25479   Certified

[25480 rows x 1 columns]

In [95]:
visa_df.case_status

0           Denied
1        Certified
2           Denied
3           Denied
4        Certified
           ...
25475    Certified
25476    Certified
25477    Certified
25478    Certified
25479    Certified
Name: case_status, Length: 25480, dtype: object

In [97]:
visa_df.columns

Index(['case_id', 'continent', 'education_of_employee', 'has_job_experience',
       'requires_job_training', 'no_of_employees', 'yr_of_estab',
       'region_of_employment', 'prevailing_wage', 'unit_of_wage',
       'full_time_position', 'case_status'],
      dtype='object')

In [103]:
#multiple means list 
visa_df[['case_status','continent']]

      case_status continent
0          Denied      Asia
1       Certified      Asia
2          Denied      Asia
3          Denied      Asia
4       Certified    Africa
...           ...       ...
25475   Certified      Asia
25476   Certified      Asia
25477   Certified      Asia
25478   Certified      Asia
25479   Certified      Asia

[25480 rows x 2 columns]